uat_chat/Reports/ItobОтчетПоПростоямПриЗаведенномДвигателе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>ItobОтчетПоПростоямПриЗаведенномДвигателе</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Датчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobДатчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

uat_chat/Enums/уатСистемаGPS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>уатСистемаGPS</Name>
			<Comment>Cистема GPS (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Dynafleet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Omnicomm</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_1СЦСМ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

uat_chat/Reports/ItobОтчетПоПростоямПриЗаведенномДвигателе/Forms/ФормаОтчета/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура формирует отчет.
//
&НаСервере                                              
Процедура СформироватьОтчет()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");	
	
	Если ОтчетОбъект.ПроверитьЗаполнение() Тогда
		
		Результат.Очистить();
		ОтчетОбъект.СкомпоноватьРезультат(Результат);
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ОтчетОбъект, "Отчет");
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Результат.АвтоМасштаб = Истина;
	Результат.ИмяПараметровПечати = "Отчет_ItobОтчетПоПростоямПриЗаведенномДвигателе_ИмяПараметровПечати";
	
КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Обработчик события "при создании на сервере" формы
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Константы.уатИспользуемаяСистемаGPS.Получить() <> Перечисления.уатСистемаGPS._1СЦСМ тогда
		#Если Клиент тогда
			ТекстСообщения = "Открытие возможно только тогда, когда используемая система GPS - 1C:Центр спутникового мониторинга.";
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения,Отказ);
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	СписокПараметров = Неопределено;
	
	Если Параметры.Свойство("СписокПараметров", СписокПараметров) Тогда
		
		
		СписокПараметров = Параметры.СписокПараметров;
		
		
		ОтчетПоПростоямПриЗаведенномДвигателе = РеквизитФормыВЗначение("Отчет");	
		Для каждого ЭлСписка Из СписокПараметров Цикл
			
			ОтчетПоПростоямПриЗаведенномДвигателе[ЭлСписка.Представление] = ЭлСписка.Значение; 
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ОтчетПоПростоямПриЗаведенномДвигателе, "Отчет");
		
		СформироватьОтчет();
		
	КонецЕсли; 	
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Отчет.НачПериода) И НЕ ЗначениеЗаполнено(Отчет.КонПериода) Тогда
		
		Отчет.НачПериода = НачалоДня(ТекущаяДата());
		Отчет.КонПериода = КонецДня(ТекущаяДата());
		
	КонецЕсли;
		
КонецПроцедуры // ПриОткрытии()

// Процедура - обработчик команды "УстановитьИнтервал".
//
&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	
	Диалог.Период.ДатаНачала = Отчет.НачПериода;
	Диалог.Период.ДатаОкончания = Отчет.КонПериода;
	
	Если Диалог.Редактировать() Тогда
		
		Отчет.НачПериода = Диалог.Период.ДатаНачала;
		Отчет.КонПериода = Диалог.Период.ДатаОкончания;
	
	КонецЕсли;
	
КонецПроцедуры // УстановитьИнтервал()
 
// Процедура - обработчик команды "Сформировать".
//
&НаКлиенте
Процедура Сформировать(Команда)
   	
	СформироватьОтчет();
	
КонецПроцедуры // Сформировать()

// Процедура - обработчик события "Регулирование" поля "НачПериода" таблицы.
//
&НаКлиенте
Процедура НачПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отчет.НачПериода = НачалоДня(Отчет.НачПериода + Направление*24*3600);	
	
КонецПроцедуры // НачПериодаРегулирование()

// Процедура - обработчик события "Регулирование" поля "КонПериода" таблицы.
//
&НаКлиенте
Процедура КонПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Отчет.КонПериода = КонецДня(Отчет.КонПериода + Направление*24*3600);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры // КонПериодаРегулирование()

// Процедура - обработчик события "ОбработкаВыбора" поля "КонПериода" таблицы.
//
&НаКлиенте
Процедура КонПериодаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВыбранноеЗначение = КонецДня(ВыбранноеЗначение);
	Отчет.КонПериода = ВыбранноеЗначение;
	
	Элемент.УстановитьГраницыВыделения(1,СтрДлина(Элемент.ТекстРедактирования));
	Элемент.ВыделенныйТекст = Строка(ВыбранноеЗначение);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры // КонПериодаОбработкаВыбора()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ДОКУМЕНТА

// Обработчик события ОбработкаРасшифровки элемента ПолеТабличногоДокумента.
//
&НаКлиенте
Процедура ПолеТабличногоДокументаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
	
		Оповестить("РежимМаршрута", Расшифровка);
	
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // ПолеТабличногоДокументаОбработкаРасшифровки()
